"1 198 1 4206624770 ,"
"input 1 3 256 256 ,"
" 156 157 160 178 179 180 182 184 185 186 187 188 191 209 210 211 213 215 216 217 218 219 220 248 251 269 270 271 273 275 276 277 278 279 282 300 301 302 304 306 307 308 309 310 311 314 332 333 334 336 338 339 340 341 342 345 363 364 365 367 369 370 371 372 373 374 402 405 423 424 425 427 429 430 431 432 435 453 454 455 457 459 460 461 462 463 466 484 485 486 488 490 491 492 493 494 495 523 526 544 545 546 548 550 551 552 553 556 574 575 576 578 580 581 582 583 584 587 605 606 607 609 611 612 613 614 615 616 644 647 665 666 667 669 671 672 673 674 677 695 696 697 699 701 702 703 704 705 708 726 727 728 730 732 733 734 735 736 737 765 768 786 787 788 790 792 793 794 795 798 816 817 818 820 822 823 824 825 826 829 847 848 849 851 853 854 855 856 857 858 859 860 861 863 864 866 input output ,"
"output ,"
" 197 ,"
"Upsample 156 1 1 input 156 1 0 0 0 4 4 ,"
"Convolution 157 1 1 156 157 1 3 128 3 3 1 1 1 1 1 -1 1 1 ,"
"InstBatchNormCxx 160 1 1 157 160 1e-05,"
"Upsample 178 1 1 input 178 1 0 0 0 4 4 ,"
"Convolution 179 1 1 178 179 1 3 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 180 1 1 179 180 ,"
"Convolution 184 1 1 180 184 1 16 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 182 1 1 180 182 1 16 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 185 2 1 160 184 185 ,"
"Add 186 2 1 185 182 186 ,"
"PReLU 187 1 1 186 187 1 0 ,"
"Convolution 188 1 1 187 188 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"InstBatchNormCxx 191 1 1 188 191 1e-05,"
"Upsample 209 1 1 input 209 1 0 0 0 4 4 ,"
"Convolution 210 1 1 209 210 1 3 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 211 1 1 210 211 ,"
"Convolution 215 1 1 211 215 1 16 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 213 1 1 211 213 1 16 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 216 2 1 191 215 216 ,"
"Add 217 2 1 216 213 217 ,"
"PReLU 218 1 1 217 218 1 0 ,"
"Convolution 219 1 1 218 219 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Add 220 2 1 157 219 220 ,"
"Upsample 248 1 1 220 248 1 0 0 0 8 8 ,"
"InstBatchNormCxx 251 1 1 248 251 1e-05,"
"Upsample 269 1 1 input 269 1 0 0 0 8 8 ,"
"Convolution 270 1 1 269 270 1 3 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 271 1 1 270 271 ,"
"Convolution 275 1 1 271 275 1 16 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 273 1 1 271 273 1 16 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 276 2 1 251 275 276 ,"
"Add 277 2 1 276 273 277 ,"
"PReLU 278 1 1 277 278 1 0 ,"
"Convolution 279 1 1 278 279 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"InstBatchNormCxx 282 1 1 279 282 1e-05,"
"Upsample 300 1 1 input 300 1 0 0 0 8 8 ,"
"Convolution 301 1 1 300 301 1 3 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 302 1 1 301 302 ,"
"Convolution 306 1 1 302 306 1 16 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 304 1 1 302 304 1 16 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 307 2 1 282 306 307 ,"
"Add 308 2 1 307 304 308 ,"
"PReLU 309 1 1 308 309 1 0 ,"
"Convolution 310 1 1 309 310 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Add 311 2 1 248 310 311 ,"
"InstBatchNormCxx 314 1 1 311 314 1e-05,"
"Upsample 332 1 1 input 332 1 0 0 0 8 8 ,"
"Convolution 333 1 1 332 333 1 3 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 334 1 1 333 334 ,"
"Convolution 338 1 1 334 338 1 16 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 336 1 1 334 336 1 16 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 339 2 1 314 338 339 ,"
"Add 340 2 1 339 336 340 ,"
"PReLU 341 1 1 340 341 1 0 ,"
"Convolution 342 1 1 341 342 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"InstBatchNormCxx 345 1 1 342 345 1e-05,"
"Upsample 363 1 1 input 363 1 0 0 0 8 8 ,"
"Convolution 364 1 1 363 364 1 3 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 365 1 1 364 365 ,"
"Convolution 369 1 1 365 369 1 16 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 367 1 1 365 367 1 16 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 370 2 1 345 369 370 ,"
"Add 371 2 1 370 367 371 ,"
"PReLU 372 1 1 371 372 1 0 ,"
"Convolution 373 1 1 372 373 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Add 374 2 1 311 373 374 ,"
"Upsample 402 1 1 374 402 1 0 0 0 16 16 ,"
"InstBatchNormCxx 405 1 1 402 405 1e-05,"
"Upsample 423 1 1 input 423 1 0 0 0 16 16 ,"
"Convolution 424 1 1 423 424 1 3 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 425 1 1 424 425 ,"
"Convolution 429 1 1 425 429 1 16 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 427 1 1 425 427 1 16 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 430 2 1 405 429 430 ,"
"Add 431 2 1 430 427 431 ,"
"Convolution 432 1 1 431 432 1 128 64 1 1 1 1 0 0 0 -1 1 1 ,"
"InstBatchNormCxx 435 1 1 402 435 1e-05,"
"Upsample 453 1 1 input 453 1 0 0 0 16 16 ,"
"Convolution 454 1 1 453 454 1 3 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 455 1 1 454 455 ,"
"Convolution 459 1 1 455 459 1 16 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 457 1 1 455 457 1 16 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 460 2 1 435 459 460 ,"
"Add 461 2 1 460 457 461 ,"
"PReLU 462 1 1 461 462 1 0 ,"
"Convolution 463 1 1 462 463 1 128 64 3 3 1 1 1 1 1 -1 1 1 ,"
"InstBatchNormCxx 466 1 1 463 466 1e-05,"
"Upsample 484 1 1 input 484 1 0 0 0 16 16 ,"
"Convolution 485 1 1 484 485 1 3 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 486 1 1 485 486 ,"
"Convolution 490 1 1 486 490 1 16 64 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 488 1 1 486 488 1 16 64 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 491 2 1 466 490 491 ,"
"Add 492 2 1 491 488 492 ,"
"PReLU 493 1 1 492 493 1 0 ,"
"Convolution 494 1 1 493 494 1 64 64 3 3 1 1 1 1 1 -1 1 1 ,"
"Add 495 2 1 432 494 495 ,"
"Upsample 523 1 1 495 523 1 0 0 0 32 32 ,"
"InstBatchNormCxx 526 1 1 523 526 1e-05,"
"Upsample 544 1 1 input 544 1 0 0 0 32 32 ,"
"Convolution 545 1 1 544 545 1 3 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 546 1 1 545 546 ,"
"Convolution 550 1 1 546 550 1 16 64 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 548 1 1 546 548 1 16 64 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 551 2 1 526 550 551 ,"
"Add 552 2 1 551 548 552 ,"
"Convolution 553 1 1 552 553 1 64 32 1 1 1 1 0 0 0 -1 1 1 ,"
"InstBatchNormCxx 556 1 1 523 556 1e-05,"
"Upsample 574 1 1 input 574 1 0 0 0 32 32 ,"
"Convolution 575 1 1 574 575 1 3 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 576 1 1 575 576 ,"
"Convolution 580 1 1 576 580 1 16 64 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 578 1 1 576 578 1 16 64 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 581 2 1 556 580 581 ,"
"Add 582 2 1 581 578 582 ,"
"PReLU 583 1 1 582 583 1 0 ,"
"Convolution 584 1 1 583 584 1 64 32 3 3 1 1 1 1 1 -1 1 1 ,"
"InstBatchNormCxx 587 1 1 584 587 1e-05,"
"Upsample 605 1 1 input 605 1 0 0 0 32 32 ,"
"Convolution 606 1 1 605 606 1 3 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 607 1 1 606 607 ,"
"Convolution 611 1 1 607 611 1 16 32 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 609 1 1 607 609 1 16 32 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 612 2 1 587 611 612 ,"
"Add 613 2 1 612 609 613 ,"
"PReLU 614 1 1 613 614 1 0 ,"
"Convolution 615 1 1 614 615 1 32 32 3 3 1 1 1 1 1 -1 1 1 ,"
"Add 616 2 1 553 615 616 ,"
"Upsample 644 1 1 616 644 1 0 0 0 64 64 ,"
"InstBatchNormCxx 647 1 1 644 647 1e-05,"
"Upsample 665 1 1 input 665 1 0 0 0 64 64 ,"
"Convolution 666 1 1 665 666 1 3 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 667 1 1 666 667 ,"
"Convolution 671 1 1 667 671 1 16 32 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 669 1 1 667 669 1 16 32 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 672 2 1 647 671 672 ,"
"Add 673 2 1 672 669 673 ,"
"Convolution 674 1 1 673 674 1 32 16 1 1 1 1 0 0 0 -1 1 1 ,"
"InstBatchNormCxx 677 1 1 644 677 1e-05,"
"Upsample 695 1 1 input 695 1 0 0 0 64 64 ,"
"Convolution 696 1 1 695 696 1 3 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 697 1 1 696 697 ,"
"Convolution 701 1 1 697 701 1 16 32 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 699 1 1 697 699 1 16 32 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 702 2 1 677 701 702 ,"
"Add 703 2 1 702 699 703 ,"
"PReLU 704 1 1 703 704 1 0 ,"
"Convolution 705 1 1 704 705 1 32 16 3 3 1 1 1 1 1 -1 1 1 ,"
"InstBatchNormCxx 708 1 1 705 708 1e-05,"
"Upsample 726 1 1 input 726 1 0 0 0 64 64 ,"
"Convolution 727 1 1 726 727 1 3 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 728 1 1 727 728 ,"
"Convolution 732 1 1 728 732 1 16 16 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 730 1 1 728 730 1 16 16 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 733 2 1 708 732 733 ,"
"Add 734 2 1 733 730 734 ,"
"PReLU 735 1 1 734 735 1 0 ,"
"Convolution 736 1 1 735 736 1 16 16 3 3 1 1 1 1 1 -1 1 1 ,"
"Add 737 2 1 674 736 737 ,"
"Upsample 765 1 1 737 765 1 0 0 0 128 128 ,"
"InstBatchNormCxx 768 1 1 765 768 1e-05,"
"Upsample 786 1 1 input 786 1 0 0 0 128 128 ,"
"Convolution 787 1 1 786 787 1 3 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 788 1 1 787 788 ,"
"Convolution 792 1 1 788 792 1 16 16 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 790 1 1 788 790 1 16 16 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 793 2 1 768 792 793 ,"
"Add 794 2 1 793 790 794 ,"
"Convolution 795 1 1 794 795 1 16 8 1 1 1 1 0 0 0 -1 1 1 ,"
"InstBatchNormCxx 798 1 1 765 798 1e-05,"
"Upsample 816 1 1 input 816 1 0 0 0 128 128 ,"
"Convolution 817 1 1 816 817 1 3 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 818 1 1 817 818 ,"
"Convolution 822 1 1 818 822 1 16 16 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 820 1 1 818 820 1 16 16 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 823 2 1 798 822 823 ,"
"Add 824 2 1 823 820 824 ,"
"PReLU 825 1 1 824 825 1 0 ,"
"Convolution 826 1 1 825 826 1 16 8 3 3 1 1 1 1 1 -1 1 1 ,"
"InstBatchNormCxx 829 1 1 826 829 1e-05,"
"Upsample 847 1 1 input 847 1 0 0 0 128 128 ,"
"Convolution 848 1 1 847 848 1 3 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 849 1 1 848 849 ,"
"Convolution 853 1 1 849 853 1 16 8 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 851 1 1 849 851 1 16 8 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 854 2 1 829 853 854 ,"
"Add 855 2 1 854 851 855 ,"
"PReLU 856 1 1 855 856 1 0 ,"
"Convolution 857 1 1 856 857 1 8 8 3 3 1 1 1 1 1 -1 1 1 ,"
"Add 858 2 1 795 857 858 ,"
"PReLU 859 1 1 858 859 1 0 ,"
"Convolution 860 1 1 859 860 1 8 12 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 861 1 1 860 861 1 12 12 3 3 1 1 1 1 1 -1 1 1 ,"
"Reshape 863 1 1 861 863 0 4 4 0 3 2 2 ,"
"Permute 864 1 1 863 864 6 0 1 4 2 5 3 ,"
"Reshape 866 1 1 864 866 0 4 4 0 3 256 256 ,"
"Tanh output 1 1 866 output ,"
