"1 109 1 4206624770 ,"
"hidden 1 128 64 64 ,"
" 270 271 273 274 276 277 278 280 281 283 284 286 287 288 289 291 292 294 295 297 298 299 301 302 304 305 307 308 309 310 312 313 315 316 318 319 320 322 323 325 326 328 329 330 331 333 334 336 337 339 340 341 343 344 346 347 349 350 351 352 354 355 357 358 360 361 362 364 365 367 368 370 371 372 373 375 376 378 379 381 382 383 385 386 388 389 391 392 393 394 396 397 407 409 410 412 413 414 416 417 427 429 430 432 433 434 435 hidden out ,"
"out ,"
" 108 ,"
"Convolution Conv_0 1 1 hidden 270 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_2 1 1 270 271 ,"
"Convolution Conv_3 1 1 271 273 1 128 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_5 1 1 273 274 ,"
"Convolution Conv_6 1 1 274 276 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_8 1 1 276 277 ,"
"Concat Concat_9 2 1 274 277 278 1 ,"
"Convolution Conv_10 1 1 278 280 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_12 1 1 280 281 ,"
"Convolution Conv_13 1 1 281 283 1 128 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_15 1 1 283 284 ,"
"Convolution Conv_16 1 1 284 286 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_18 1 1 286 287 ,"
"Concat Concat_19 2 1 284 287 288 1 ,"
"Add Add_20 2 1 288 hidden 289 ,"
"Convolution Conv_21 1 1 289 291 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_23 1 1 291 292 ,"
"Convolution Conv_24 1 1 292 294 1 128 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_26 1 1 294 295 ,"
"Convolution Conv_27 1 1 295 297 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_29 1 1 297 298 ,"
"Concat Concat_30 2 1 295 298 299 1 ,"
"Convolution Conv_31 1 1 299 301 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_33 1 1 301 302 ,"
"Convolution Conv_34 1 1 302 304 1 128 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_36 1 1 304 305 ,"
"Convolution Conv_37 1 1 305 307 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_39 1 1 307 308 ,"
"Concat Concat_40 2 1 305 308 309 1 ,"
"Add Add_41 2 1 309 289 310 ,"
"Convolution Conv_42 1 1 310 312 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_44 1 1 312 313 ,"
"Convolution Conv_45 1 1 313 315 1 128 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_47 1 1 315 316 ,"
"Convolution Conv_48 1 1 316 318 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_50 1 1 318 319 ,"
"Concat Concat_51 2 1 316 319 320 1 ,"
"Convolution Conv_52 1 1 320 322 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_54 1 1 322 323 ,"
"Convolution Conv_55 1 1 323 325 1 128 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_57 1 1 325 326 ,"
"Convolution Conv_58 1 1 326 328 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_60 1 1 328 329 ,"
"Concat Concat_61 2 1 326 329 330 1 ,"
"Add Add_62 2 1 330 310 331 ,"
"Convolution Conv_63 1 1 331 333 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_65 1 1 333 334 ,"
"Convolution Conv_66 1 1 334 336 1 128 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_68 1 1 336 337 ,"
"Convolution Conv_69 1 1 337 339 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_71 1 1 339 340 ,"
"Concat Concat_72 2 1 337 340 341 1 ,"
"Convolution Conv_73 1 1 341 343 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_75 1 1 343 344 ,"
"Convolution Conv_76 1 1 344 346 1 128 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_78 1 1 346 347 ,"
"Convolution Conv_79 1 1 347 349 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_81 1 1 349 350 ,"
"Concat Concat_82 2 1 347 350 351 1 ,"
"Add Add_83 2 1 351 331 352 ,"
"Convolution Conv_84 1 1 352 354 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_86 1 1 354 355 ,"
"Convolution Conv_87 1 1 355 357 1 128 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_89 1 1 357 358 ,"
"Convolution Conv_90 1 1 358 360 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_92 1 1 360 361 ,"
"Concat Concat_93 2 1 358 361 362 1 ,"
"Convolution Conv_94 1 1 362 364 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_96 1 1 364 365 ,"
"Convolution Conv_97 1 1 365 367 1 128 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_99 1 1 367 368 ,"
"Convolution Conv_100 1 1 368 370 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_102 1 1 370 371 ,"
"Concat Concat_103 2 1 368 371 372 1 ,"
"Add Add_104 2 1 372 352 373 ,"
"Convolution Conv_105 1 1 373 375 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_107 1 1 375 376 ,"
"Convolution Conv_108 1 1 376 378 1 128 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_110 1 1 378 379 ,"
"Convolution Conv_111 1 1 379 381 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_113 1 1 381 382 ,"
"Concat Concat_114 2 1 379 382 383 1 ,"
"Convolution Conv_115 1 1 383 385 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_117 1 1 385 386 ,"
"Convolution Conv_118 1 1 386 388 1 128 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_120 1 1 388 389 ,"
"Convolution Conv_121 1 1 389 391 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_123 1 1 391 392 ,"
"Concat Concat_124 2 1 389 392 393 1 ,"
"Add Add_125 2 1 393 373 394 ,"
"Convolution Conv_126 1 1 394 396 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_128 1 1 396 397 ,"
"Upsample Resize_130 1 1 397 407 2 2 2 0 ,"
"Convolution Conv_131 1 1 407 409 1 128 32 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_133 1 1 409 410 ,"
"Convolution Conv_134 1 1 410 412 32 1 32 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_136 1 1 412 413 ,"
"Concat Concat_137 2 1 410 413 414 1 ,"
"Convolution Conv_138 1 1 414 416 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_140 1 1 416 417 ,"
"Upsample Resize_142 1 1 417 427 2 2 2 0 ,"
"Convolution Conv_143 1 1 427 429 1 64 16 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_145 1 1 429 430 ,"
"Convolution Conv_146 1 1 430 432 16 1 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_148 1 1 432 433 ,"
"Concat Concat_149 2 1 430 433 434 1 ,"
"Convolution Conv_150 1 1 434 435 1 32 3 3 3 1 1 1 1 1 -1 1 1 ,"
"Sigmoid Sigmoid_151 1 1 435 out ,"
