"1 77 1 4206624770 ,"
"heatmap 1 11 1 4096 : sparse_motion 1 11 4096 2 : deformed_source 1 11 3 4096 ,"
" 150 151 152 153 162 164 165 168 170 171 173 174 176 177 178 180 181 183 184 186 187 188 190 191 193 194 196 197 198 200 201 211 213 214 216 217 219 221 222 232 234 235 237 238 240 242 243 253 255 256 258 259 261 263 264 274 276 277 279 280 281 282 289 290 291 292 301 302 303 304 305 315 deformation deformed_source heatmap occlusion sparse_motion ,"
"deformation occlusion ,"
" 74 ,"
"Permute Transpose_3 1 1 heatmap 150 4 0 2 1 3 ,"
"Permute Transpose_4 1 1 deformed_source 151 4 0 2 1 3 ,"
"Concat Concat_5 2 1 150 151 152 1 ,"
"Permute Transpose_6 1 1 152 153 4 0 2 1 3 ,"
"Reshape Reshape_9 1 1 153 162 0 4 4 0 -1 64 64 ,"
"Convolution Conv_10 1 1 162 164 1 44 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_12 1 1 164 165 ,"
"Pooling AveragePool_15 1 1 165 168 1 2 2 2 2 0 0 -1 -1 -1 0 ,"
"Convolution Conv_16 1 1 168 170 128 1 128 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_18 1 1 170 171 ,"
"Convolution Conv_19 1 1 171 173 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_21 1 1 173 174 ,"
"Convolution Conv_22 1 1 174 176 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_24 1 1 176 177 ,"
"Concat Concat_25 2 1 174 177 178 1 ,"
"Convolution Conv_26 1 1 178 180 256 1 256 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_28 1 1 180 181 ,"
"Convolution Conv_29 1 1 181 183 1 256 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_31 1 1 183 184 ,"
"Convolution Conv_32 1 1 184 186 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_34 1 1 186 187 ,"
"Concat Concat_35 2 1 184 187 188 1 ,"
"Convolution Conv_36 1 1 188 190 256 1 256 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_38 1 1 190 191 ,"
"Convolution Conv_39 1 1 191 193 1 256 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_41 1 1 193 194 ,"
"Convolution Conv_42 1 1 194 196 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_44 1 1 196 197 ,"
"Concat Concat_45 2 1 194 197 198 1 ,"
"Convolution Conv_46 1 1 198 200 256 1 256 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_48 1 1 200 201 ,"
"Upsample Resize_50 1 1 201 211 2 2 2 0 ,"
"Convolution Conv_51 1 1 211 213 1 256 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_53 1 1 213 214 ,"
"Convolution Conv_54 1 1 214 216 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_56 1 1 216 217 ,"
"Concat Concat_58 3 1 214 217 188 219 1 ,"
"Convolution Conv_59 1 1 219 221 512 1 512 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_61 1 1 221 222 ,"
"Upsample Resize_63 1 1 222 232 2 2 2 0 ,"
"Convolution Conv_64 1 1 232 234 1 512 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_66 1 1 234 235 ,"
"Convolution Conv_67 1 1 235 237 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_69 1 1 237 238 ,"
"Concat Concat_71 3 1 235 238 178 240 1 ,"
"Convolution Conv_72 1 1 240 242 512 1 512 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_74 1 1 242 243 ,"
"Upsample Resize_76 1 1 243 253 2 2 2 0 ,"
"Convolution Conv_77 1 1 253 255 1 512 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_79 1 1 255 256 ,"
"Convolution Conv_80 1 1 256 258 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_82 1 1 258 259 ,"
"Concat Concat_84 3 1 256 259 168 261 1 ,"
"Convolution Conv_85 1 1 261 263 256 1 256 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_87 1 1 263 264 ,"
"Upsample Resize_89 1 1 264 274 2 2 2 0 ,"
"Convolution Conv_90 1 1 274 276 1 256 32 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_92 1 1 276 277 ,"
"Convolution Conv_93 1 1 277 279 32 1 32 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_95 1 1 279 280 ,"
"Concat Concat_96 2 1 277 280 281 1 ,"
"Convolution Conv_97 1 1 281 282 1 64 11 3 3 1 1 1 1 1 -1 1 1 ,"
"Reshape Reshape_100 1 1 282 289 0 4 4 0 -1 4096 1 ,"
"Permute Transpose_101 1 1 289 290 3 0 2 1 ,"
"SoftmaxCaffe Softmax_102 1 1 290 291 2 ,"
"Permute Transpose_103 1 1 291 292 3 0 2 1 ,"
"Reshape Reshape_106 1 1 292 301 0 4 4 0 1 -1 4096 ,"
"Permute Transpose_107 1 1 sparse_motion 302 4 0 3 1 2 ,"
"Mul Mul_108 2 1 302 301 303 ,"
"Permute Transpose_109 1 1 303 304 4 0 2 3 1 ,"
"ReduceSum ReduceSum_110 1 1 304 305 1 1 ,"
"Reshape Reshape_113 1 1 305 deformation 0 4 4 0 64 64 2 ,"
"Convolution Conv_114 1 1 281 315 1 64 1 3 3 1 1 1 1 1 -1 1 1 ,"
"Sigmoid Sigmoid_115 1 1 315 occlusion ,"
