"1 160 1 4206624770 ,"
"source_image 1 3 256 256 : kpdv_i 1 10 1 2 : kpdj_i 1 10 2 2 : kpdv 1 10 1 2 : kpsv 1 10 1 2 : kpdj 1 10 2 2 : kpsj 1 10 2 2 : grid 1 4096 10 2 : zeros 1 1 64 64 ,"
" 102 103 104 105 106 107 108 109 110 111 112 113 114 119 12 124 129 13 134 139 144 149 154 155 156 157 158 159 160 161 162 163 164 165 166 173 18 180 187 194 195 196 205 206 207 210 211 212 214 215 227 228 229 23 230 233 234 235 237 238 250 251 252 253 267 272 277 28 282 287 292 297 302 303 304 305 306 307 308 309 310 311 316 321 326 33 331 336 341 346 351 352 353 354 355 356 357 358 359 360 361 362 363 364 365 366 367 368 369 374 379 38 380 381 382 383 384 385 386 387 388 389 390 391 396 397 398 409 418 43 48 53 54 55 56 57 58 59 60 61 62 67 72 77 82 87 92 97 grid heatmap kpdj kpdj_i kpdv kpdv_i kpsj kpsv source_image source_repeat sparse_motion zeros ,"
"heatmap sparse_motion source_repeat ,"
" 151 ,"
"Sub Sub_3 2 1 kpdv kpdv_i 12 ,"
"Add Add_4 2 1 12 kpsv 13 ,"
"StridedSlice Slice_9 1 1 kpdj_i 18 4 0 0 0 0 4 0 0 1 0 4 1 1 1 1 ,"
"StridedSlice Slice_14 1 1 18 23 4 0 0 0 0 4 0 0 0 1 4 1 1 1 1 ,"
"StridedSlice Slice_19 1 1 kpdj_i 28 4 0 0 0 0 4 0 0 1 0 4 1 1 1 1 ,"
"StridedSlice Slice_24 1 1 28 33 4 0 0 0 1 4 0 0 0 0 4 1 1 1 1 ,"
"StridedSlice Slice_29 1 1 kpdj_i 38 4 0 0 1 0 4 0 0 0 0 4 1 1 1 1 ,"
"StridedSlice Slice_34 1 1 38 43 4 0 0 0 0 4 0 0 0 1 4 1 1 1 1 ,"
"StridedSlice Slice_39 1 1 kpdj_i 48 4 0 0 1 0 4 0 0 0 0 4 1 1 1 1 ,"
"StridedSlice Slice_44 1 1 48 53 4 0 0 0 1 4 0 0 0 0 4 1 1 1 1 ,"
"Mul Mul_45 2 1 23 53 54 ,"
"Mul Mul_46 2 1 33 43 55 ,"
"Sub Sub_47 2 1 54 55 56 ,"
"Div Div_48 2 1 53 56 57 ,"
"Neg Neg_49 1 1 33 58 ,"
"Div Div_50 2 1 58 56 59 ,"
"Neg Neg_51 1 1 43 60 ,"
"Div Div_52 2 1 60 56 61 ,"
"Div Div_53 2 1 23 56 62 ,"
"StridedSlice Slice_58 1 1 kpdj 67 4 0 0 0 0 4 0 0 1 0 4 1 1 1 1 ,"
"StridedSlice Slice_63 1 1 67 72 4 0 0 0 0 4 0 0 0 1 4 1 1 1 1 ,"
"StridedSlice Slice_68 1 1 kpdj 77 4 0 0 0 0 4 0 0 1 0 4 1 1 1 1 ,"
"StridedSlice Slice_73 1 1 77 82 4 0 0 0 1 4 0 0 0 0 4 1 1 1 1 ,"
"StridedSlice Slice_78 1 1 kpdj 87 4 0 0 1 0 4 0 0 0 0 4 1 1 1 1 ,"
"StridedSlice Slice_83 1 1 87 92 4 0 0 0 0 4 0 0 0 1 4 1 1 1 1 ,"
"StridedSlice Slice_88 1 1 kpdj 97 4 0 0 1 0 4 0 0 0 0 4 1 1 1 1 ,"
"StridedSlice Slice_93 1 1 97 102 4 0 0 0 1 4 0 0 0 0 4 1 1 1 1 ,"
"Mul Mul_94 2 1 72 57 103 ,"
"Mul Mul_95 2 1 82 61 104 ,"
"Add Add_96 2 1 103 104 105 ,"
"Mul Mul_97 2 1 72 59 106 ,"
"Mul Mul_98 2 1 82 62 107 ,"
"Add Add_99 2 1 106 107 108 ,"
"Mul Mul_100 2 1 92 57 109 ,"
"Mul Mul_101 2 1 102 61 110 ,"
"Add Add_102 2 1 109 110 111 ,"
"Mul Mul_103 2 1 92 59 112 ,"
"Mul Mul_104 2 1 102 62 113 ,"
"Add Add_105 2 1 112 113 114 ,"
"StridedSlice Slice_110 1 1 kpsj 119 4 0 0 0 0 4 0 0 1 0 4 1 1 1 1 ,"
"StridedSlice Slice_115 1 1 119 124 4 0 0 0 0 4 0 0 0 1 4 1 1 1 1 ,"
"StridedSlice Slice_120 1 1 kpsj 129 4 0 0 0 0 4 0 0 1 0 4 1 1 1 1 ,"
"StridedSlice Slice_125 1 1 129 134 4 0 0 0 1 4 0 0 0 0 4 1 1 1 1 ,"
"StridedSlice Slice_130 1 1 kpsj 139 4 0 0 1 0 4 0 0 0 0 4 1 1 1 1 ,"
"StridedSlice Slice_135 1 1 139 144 4 0 0 0 0 4 0 0 0 1 4 1 1 1 1 ,"
"StridedSlice Slice_140 1 1 kpsj 149 4 0 0 1 0 4 0 0 0 0 4 1 1 1 1 ,"
"StridedSlice Slice_145 1 1 149 154 4 0 0 0 1 4 0 0 0 0 4 1 1 1 1 ,"
"Mul Mul_146 2 1 105 124 155 ,"
"Mul Mul_147 2 1 108 144 156 ,"
"Add Add_148 2 1 155 156 157 ,"
"Mul Mul_149 2 1 105 134 158 ,"
"Mul Mul_150 2 1 108 154 159 ,"
"Add Add_151 2 1 158 159 160 ,"
"Mul Mul_152 2 1 111 124 161 ,"
"Mul Mul_153 2 1 114 144 162 ,"
"Add Add_154 2 1 161 162 163 ,"
"Mul Mul_155 2 1 111 134 164 ,"
"Mul Mul_156 2 1 114 154 165 ,"
"Add Add_157 2 1 164 165 166 ,"
"Reshape Reshape_160 1 1 157 173 0 4 4 0 1 10 1 ,"
"Reshape Reshape_163 1 1 160 180 0 4 4 0 1 10 1 ,"
"Reshape Reshape_166 1 1 163 187 0 4 4 0 1 10 1 ,"
"Reshape Reshape_169 1 1 166 194 0 4 4 0 1 10 1 ,"
"Concat Concat_170 4 1 173 180 187 194 195 1 ,"
"Permute Transpose_171 1 1 195 196 3 0 2 1 ,"
"Reshape Reshape_174 1 1 196 205 0 4 4 0 10 2 2 ,"
"Permute Transpose_175 1 1 13 206 4 0 2 1 3 ,"
"Sub Sub_176 2 1 grid 206 207 ,"
"Power Pow_177 1 1 207 210 2 1 0 ,"
"Permute Transpose_178 1 1 210 211 4 0 3 1 2 ,"
"ReduceSum ReduceSum_179 1 1 211 212 1 1 ,"
"Mul Mul_181 1 1 212 214 1 ,"
"Exp Exp_182 1 1 214 215 ,"
"Reshape Reshape_188 1 1 215 227 0 4 4 0 64 64 10 ,"
"Permute Transpose_189 1 1 227 228 4 0 3 1 2 ,"
"Permute Transpose_190 1 1 kpsv 229 4 0 2 1 3 ,"
"Sub Sub_191 2 1 grid 229 230 ,"
"Power Pow_192 1 1 230 233 2 1 0 ,"
"Permute Transpose_193 1 1 233 234 4 0 3 1 2 ,"
"ReduceSum ReduceSum_194 1 1 234 235 1 1 ,"
"Mul Mul_196 1 1 235 237 1 ,"
"Exp Exp_197 1 1 237 238 ,"
"Reshape Reshape_203 1 1 238 250 0 4 4 0 64 64 10 ,"
"Permute Transpose_204 1 1 250 251 4 0 3 1 2 ,"
"Sub Sub_205 2 1 228 251 252 ,"
"Concat Concat_206 2 1 zeros 252 253 1 ,"
"Reshape Reshape_209 1 1 253 heatmap 0 4 4 0 11 1 4096 ,"
"StridedSlice Slice_214 1 1 205 267 4 0 0 0 0 4 0 0 1 0 4 1 1 1 1 ,"
"StridedSlice Slice_219 1 1 267 272 4 0 0 0 0 4 0 0 0 1 4 1 1 1 1 ,"
"StridedSlice Slice_224 1 1 205 277 4 0 0 0 0 4 0 0 1 0 4 1 1 1 1 ,"
"StridedSlice Slice_229 1 1 277 282 4 0 0 0 1 4 0 0 0 0 4 1 1 1 1 ,"
"StridedSlice Slice_234 1 1 205 287 4 0 0 1 0 4 0 0 0 0 4 1 1 1 1 ,"
"StridedSlice Slice_239 1 1 287 292 4 0 0 0 0 4 0 0 0 1 4 1 1 1 1 ,"
"StridedSlice Slice_244 1 1 205 297 4 0 0 1 0 4 0 0 0 0 4 1 1 1 1 ,"
"StridedSlice Slice_249 1 1 297 302 4 0 0 0 1 4 0 0 0 0 4 1 1 1 1 ,"
"Mul Mul_250 2 1 272 302 303 ,"
"Mul Mul_251 2 1 282 292 304 ,"
"Sub Sub_252 2 1 303 304 305 ,"
"Div Div_253 2 1 302 305 306 ,"
"Neg Neg_254 1 1 282 307 ,"
"Div Div_255 2 1 307 305 308 ,"
"Neg Neg_256 1 1 292 309 ,"
"Div Div_257 2 1 309 305 310 ,"
"Div Div_258 2 1 272 305 311 ,"
"StridedSlice Slice_263 1 1 kpsj 316 4 0 0 0 0 4 0 0 1 0 4 1 1 1 1 ,"
"StridedSlice Slice_268 1 1 316 321 4 0 0 0 0 4 0 0 0 1 4 1 1 1 1 ,"
"StridedSlice Slice_273 1 1 kpsj 326 4 0 0 0 0 4 0 0 1 0 4 1 1 1 1 ,"
"StridedSlice Slice_278 1 1 326 331 4 0 0 0 1 4 0 0 0 0 4 1 1 1 1 ,"
"StridedSlice Slice_283 1 1 kpsj 336 4 0 0 1 0 4 0 0 0 0 4 1 1 1 1 ,"
"StridedSlice Slice_288 1 1 336 341 4 0 0 0 0 4 0 0 0 1 4 1 1 1 1 ,"
"StridedSlice Slice_293 1 1 kpsj 346 4 0 0 1 0 4 0 0 0 0 4 1 1 1 1 ,"
"StridedSlice Slice_298 1 1 346 351 4 0 0 0 1 4 0 0 0 0 4 1 1 1 1 ,"
"Mul Mul_299 2 1 321 306 352 ,"
"Mul Mul_300 2 1 331 310 353 ,"
"Add Add_301 2 1 352 353 354 ,"
"Mul Mul_302 2 1 321 308 355 ,"
"Mul Mul_303 2 1 331 311 356 ,"
"Add Add_304 2 1 355 356 357 ,"
"Mul Mul_305 2 1 341 306 358 ,"
"Mul Mul_306 2 1 351 310 359 ,"
"Add Add_307 2 1 358 359 360 ,"
"Mul Mul_308 2 1 341 308 361 ,"
"Mul Mul_309 2 1 351 311 362 ,"
"Add Add_310 2 1 361 362 363 ,"
"Permute Transpose_311 1 1 354 364 4 0 2 1 3 ,"
"Permute Transpose_312 1 1 357 365 4 0 2 1 3 ,"
"Permute Transpose_313 1 1 360 366 4 0 2 1 3 ,"
"Permute Transpose_314 1 1 363 367 4 0 2 1 3 ,"
"Permute Transpose_315 1 1 13 368 4 0 2 1 3 ,"
"Sub Sub_316 2 1 grid 368 369 ,"
"StridedSlice Slice_321 1 1 369 374 4 0 0 0 0 4 0 0 0 1 4 1 1 1 1 ,"
"StridedSlice Slice_326 1 1 369 379 4 0 0 0 1 4 0 0 0 0 4 1 1 1 1 ,"
"Mul Mul_327 2 1 364 374 380 ,"
"Mul Mul_328 2 1 365 379 381 ,"
"Add Add_329 2 1 380 381 382 ,"
"Permute Transpose_330 1 1 382 383 4 0 3 1 2 ,"
"Mul Mul_331 2 1 366 374 384 ,"
"Mul Mul_332 2 1 367 379 385 ,"
"Add Add_333 2 1 384 385 386 ,"
"Permute Transpose_334 1 1 386 387 4 0 3 1 2 ,"
"Concat Concat_335 2 1 383 387 388 1 ,"
"Permute Transpose_336 1 1 388 389 4 0 2 3 1 ,"
"Permute Transpose_337 1 1 kpsv 390 4 0 2 1 3 ,"
"Add Add_338 2 1 389 390 391 ,"
"StridedSlice Slice_343 1 1 grid 396 4 0 0 0 0 4 0 0 1 0 4 1 1 1 1 ,"
"Permute Transpose_344 1 1 396 397 4 0 2 1 3 ,"
"Permute Transpose_345 1 1 391 398 4 0 2 1 3 ,"
"Concat Concat_346 2 1 397 398 sparse_motion 1 ,"
"Upsample Resize_348 1 1 source_image 409 2 0.25 0.25 0 ,"
"Reshape Reshape_351 1 1 409 418 0 4 4 0 1 3 4096 ,"
"Concat Concat_352 11 1 418 418 418 418 418 418 418 418 418 418 418 source_repeat 1 ,"
