"1 82 1 4206624770 ,"
"x 1 3 256 256 : grid 1 4096 2 10 ,"
" 155 157 158 161 163 164 166 167 169 170 171 173 174 176 177 179 180 181 183 184 186 187 189 190 191 193 194 204 206 207 209 210 212 214 215 225 227 228 230 231 233 235 236 246 248 249 251 252 254 256 257 267 269 270 272 273 274 275 293 295 296 297 298 301 302 309 318 319 327 328 329 330 340 341 354 355 356 357 grid jacobian value x ,"
"value jacobian ,"
" 80 ,"
"Upsample Resize_1 1 1 x 155 2 0.25 0.25 0 ,"
"Convolution Conv_2 1 1 155 157 1 3 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_4 1 1 157 158 ,"
"Pooling AveragePool_7 1 1 158 161 1 2 2 2 2 0 0 -1 -1 -1 0 ,"
"Convolution Conv_8 1 1 161 163 128 1 128 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_10 1 1 163 164 ,"
"Convolution Conv_11 1 1 164 166 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_13 1 1 166 167 ,"
"Convolution Conv_14 1 1 167 169 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_16 1 1 169 170 ,"
"Concat Concat_17 2 1 167 170 171 1 ,"
"Convolution Conv_18 1 1 171 173 256 1 256 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_20 1 1 173 174 ,"
"Convolution Conv_21 1 1 174 176 1 256 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_23 1 1 176 177 ,"
"Convolution Conv_24 1 1 177 179 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_26 1 1 179 180 ,"
"Concat Concat_27 2 1 177 180 181 1 ,"
"Convolution Conv_28 1 1 181 183 256 1 256 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_30 1 1 183 184 ,"
"Convolution Conv_31 1 1 184 186 1 256 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_33 1 1 186 187 ,"
"Convolution Conv_34 1 1 187 189 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_36 1 1 189 190 ,"
"Concat Concat_37 2 1 187 190 191 1 ,"
"Convolution Conv_38 1 1 191 193 256 1 256 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_40 1 1 193 194 ,"
"Upsample Resize_42 1 1 194 204 2 2 2 0 ,"
"Convolution Conv_43 1 1 204 206 1 256 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_45 1 1 206 207 ,"
"Convolution Conv_46 1 1 207 209 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_48 1 1 209 210 ,"
"Concat Concat_50 3 1 207 210 181 212 1 ,"
"Convolution Conv_51 1 1 212 214 512 1 512 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_53 1 1 214 215 ,"
"Upsample Resize_55 1 1 215 225 2 2 2 0 ,"
"Convolution Conv_56 1 1 225 227 1 512 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_58 1 1 227 228 ,"
"Convolution Conv_59 1 1 228 230 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_61 1 1 230 231 ,"
"Concat Concat_63 3 1 228 231 171 233 1 ,"
"Convolution Conv_64 1 1 233 235 512 1 512 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_66 1 1 235 236 ,"
"Upsample Resize_68 1 1 236 246 2 2 2 0 ,"
"Convolution Conv_69 1 1 246 248 1 512 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_71 1 1 248 249 ,"
"Convolution Conv_72 1 1 249 251 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_74 1 1 251 252 ,"
"Concat Concat_76 3 1 249 252 161 254 1 ,"
"Convolution Conv_77 1 1 254 256 256 1 256 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_79 1 1 256 257 ,"
"Upsample Resize_81 1 1 257 267 2 2 2 0 ,"
"Convolution Conv_82 1 1 267 269 1 256 32 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_84 1 1 269 270 ,"
"Convolution Conv_85 1 1 270 272 32 1 32 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_87 1 1 272 273 ,"
"Concat Concat_88 2 1 270 273 274 1 ,"
"Convolution Conv_89 1 1 274 275 1 64 10 3 3 1 1 1 1 1 -1 1 1 ,"
"Reshape Reshape_105 1 1 275 293 0 4 4 0 10 -1 1 ,"
"Mul Div_107 1 1 293 295 1 ,"
"Permute Transpose_108 1 1 295 296 3 0 2 1 ,"
"ReduceMax ReduceMax_109 1 1 296 297 1 1 ,"
"Sub Sub_110 2 1 296 297 298 ,"
"SoftmaxCaffe Exp_111 1 1 298 301 1 ,"
"Permute Transpose_114 1 1 301 302 3 0 2 1 ,"
"Convolution Conv_121 1 1 274 309 1 64 40 3 3 1 1 1 1 1 -1 1 1 ,"
"Reshape Reshape_126 1 1 309 318 0 4 4 0 10 4 4096 ,"
"Permute Transpose_127 1 1 318 319 4 0 2 1 3 ,"
"Reshape Reshape_133 1 1 302 327 0 4 4 0 1 10 4096 ,"
"Mul Mul_134 2 1 327 319 328 ,"
"Permute Transpose_135 1 1 328 329 4 0 3 1 2 ,"
"ReduceSum ReduceSum_136 1 1 329 330 1 1 ,"
"Reshape Reshape_142 1 1 330 340 0 4 4 0 4 10 1 ,"
"Permute Transpose_143 1 1 340 341 3 0 2 1 ,"
"Reshape Reshape_149 1 1 341 jacobian 0 4 4 0 10 2 2 ,"
"Concat Concat_150 2 1 327 327 354 1 ,"
"Permute Transpose_151 1 1 354 355 4 0 3 1 2 ,"
"Mul Mul_152 2 1 355 grid 356 ,"
"ReduceSum ReduceSum_153 1 1 356 357 1 1 ,"
"Permute Transpose_154 1 1 357 value 4 0 3 1 2 ,"
