"1 9 1 4206624770 ,"
"x 1 3 256 256 ,"
" 23 24 26 27 30 32 33 hidden x ,"
"hidden ,"
" 8 ,"
"Convolution Conv_0 1 1 x 23 1 3 32 7 7 1 1 3 3 1 -1 1 1 ,"
"ReLU Relu_2 1 1 23 24 ,"
"Convolution Conv_3 1 1 24 26 1 32 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_5 1 1 26 27 ,"
"Pooling AveragePool_8 1 1 27 30 1 2 2 2 2 0 0 -1 -1 -1 0 ,"
"Convolution Conv_9 1 1 30 32 1 64 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_11 1 1 32 33 ,"
"Pooling AveragePool_14 1 1 33 hidden 1 2 2 2 2 0 0 -1 -1 -1 0 ,"
